---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumLuminance
source: html/607558dc-f08f-81f0-196d-4709563611f3.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumLuminance Property

The property labeled "Luminance" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericSelfIllumLuminance { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".